Repository: pdfpass/PDFPass
Catalog: Resources/Strings.*.resx
Languages: cs_cz, fi_fi, sk_sk

# ClipboardValuePrefix
source: Value: '
cs_cz: Hodnota: '
fi_fi: Arvo: '
sk_sk: Hodnota: '

# ApplicationTitle
source: PDFPass - Open Source PDF Password Manager
cs_cz: PDFPass - Open Source nástroj pro správu hesel PDF
fi_fi: PDFPass - Avoimen lähdekoodin työkalu PDF-salasanojen hallintaan
sk_sk: PDFPass - Nástroj s otvoreným kódom pre správu PDF hesiel

# InputFile
source: Source File
cs_cz: Zdrojový soubor
fi_fi: Lähdetiedosto
sk_sk: Vstupný súbor

# SelectFileForEncryption
source: Select a file to encrypt:
cs_cz: Vybrat soubor pro zašifrování:
fi_fi: Valitse tiedosto salaukseen:
sk_sk: Vybrať súbor pre zašifrovanie:

# OutputFile
source: Destination File
cs_cz: Výstupní soubor
fi_fi: Tulostiedosto
sk_sk: Výstupný súbor

# SelectPathForEncryptedFile
source: Select destination for encrypted file:
cs_cz: Vybrat cestu pro zašifrovaný soubor:
fi_fi: Valitse polku salatulle tiedostolle:
sk_sk: Vybrať cestu pre zašifrovaný súbor:

source: Passwords
cs_cz: Hesla
fi_fi: Salasanat
sk_sk: Heslá

source: Change
cs_cz: Změnit
fi_fi: Muuta
sk_sk: Zmeniť

# OwnerPasswordSet
source: Owner password has been set.
cs_cz: Heslo vlastníka nastaveno.
fi_fi: Omistajan salasana asetettu.
sk_sk: Heslo vlastníka nastavené.

# OwnerPasswordEmpty
source: No owner password set.
cs_cz: Heslo vlastníka není nastaveno.
fi_fi: Omistajan salasana on tyhjä.
sk_sk: Heslo vlastníka prázdné.

source: Copied to clipboard.
cs_cz: Zkopírováno do schránky.
fi_fi: Kopioitu leikepöydälle.
sk_sk: Skopírované do schránky.

# PasswordForLocking
source: Password to protect PDF 🔒
cs_cz: Heslo pro zabezpečení PDF 🔒
fi_fi: Lukitussalasana 🔒
sk_sk: Heslo pre uzamknutie čítania 🔒

# PasswordForUnlocking
source: Password to unlock PDF 🔓
cs_cz: Heslo pro odemknutí PDF 🔓
fi_fi: Avaussalasana PDF:lle 🔓
sk_sk: Heslo pre odomknutie PDF 🔓

source: Generate
cs_cz: Generovat
fi_fi: Generoi
sk_sk: Generuj

source: (enter password)
cs_cz: (zadejte heslo)
fi_fi: (anna salasana)
sk_sk: (zadať heslo)

# PasswordLengthWarning
source: Passwords longer than 32 characters will be truncated per PDF specification.
cs_cz: Hesla delší než 32 znaků budou zkrácena podle specifikace PDF.
fi_fi: Salasanat, jotka ovat pidempiä kuin 32 merkkiä, lyhennetään PDF:n mukaisesti.
sk_sk: Heslá dlhšie ako 32 znakov budú skratené podľa špecifikácie PDF.

source: Paste
cs_cz: Vložit
fi_fi: Liitä
sk_sk: Prilepiť

source: Copy
cs_cz: Kopírovat
fi_fi: Kopioi
sk_sk: Kopírovať

source: Decrypt
cs_cz: Odhesli
fi_fi: Purkaa salaus
sk_sk: Odhesluj

# Encrypt
source: Encrtypt
cs_cz: Zaheslit
fi_fi: Salaa
sk_sk: Zahesluj

source: Close
cs_cz: Zavřít
fi_fi: Sulje
sk_sk: Zatvoriť

source: PDF files
cs_cz: PDF soubory
fi_fi: PDF-tiedostot
sk_sk: PDF súbory

source: All files
cs_cz: Všechny soubory
fi_fi: Kaikki tiedostot
sk_sk: Všetky súbory

source: Settings
cs_cz: Nastavení
fi_fi: Asetukset
sk_sk: Nastavenia

source: Version:
cs_cz: Verze:
fi_fi: Versio:
sk_sk: Verzia:

source: Watermark
cs_cz: Vodoznak
fi_fi: Vesileima
sk_sk: Vodotlač

source: Text:
fi_fi: Teksti:

# UseWatermark
source: Apply watermark 💧
cs_cz: Použít vodoznak 💧
fi_fi: Käytä vesileimaa 💧
sk_sk: Použiť vodotlač 💧

source: Sample
cs_cz: Vzor
fi_fi: Näyte
sk_sk: Vzor

# WCopy
source: Copy
cs_cz: Kopie
fi_fi: Kopio
sk_sk: Kópia

source: Confidential
cs_cz: Důvěrné
fi_fi: Luottamuksellinen
sk_sk: Dôverné

source: Draft
cs_cz: Návrh
fi_fi: Luonnos
sk_sk: Návrh

# FileNotPdfOrDamaged
source: The file is not a PDF or is corrupted!
cs_cz: Soubor není ve formátu PDF nebo je poškozen!
fi_fi: Tiedosto ei ole PDF-tyyppinen tai se on vahingoittunut!
sk_sk: Súbor nie je typu PDF alebo je poškodený!

# ErrorTitle
source: Error
cs_cz: Chyba
fi_fi: Virhe
sk_sk: Chyba

# SourceAndDestinationSame
source: Source and destination files cannot be the same or empty.
cs_cz: Zdrojový a výstupní soubor nemohou být stejné nebo prázdné.
fi_fi: Lähde- ja tulostiedosto eivät voi olla samat tai tyhjät.
sk_sk: Zdrojový a výstupný súbor nemožu byt rovnaké alebo prázdne.

# SourceDestinationError
source: Invalid source/destination
cs_cz: Neplatný zdroj/cíl
fi_fi: Virheellinen lähde/tulos
sk_sk: Chybný zdroj/výstup

source: Source file does not exist.
cs_cz: Zdrojový soubor neexistuje.
fi_fi: Lähdetiedostoa ei ole olemassa.
sk_sk: Zdrojový súbor neexistuje.

# ConfirmOverwriteFile
source: The destination file already exists. Do you want to overwrite it?
cs_cz: Výstupní soubor již existuje. Chcete ho přepsat?
fi_fi: Tulostiedosto on jo olemassa. Haluatko korvata sen?
sk_sk: Výstupny súbor už existuje. Želate si prepísať súbor?

source: Overwrite file?
cs_cz: Přepsat soubor?
fi_fi: Korvata tiedosto?
sk_sk: Prepísať súbor?

# NoPasswordEntered
source: No password entered! (at least one password is required)
cs_cz: Nebylo zadáno žádné heslo! (je vyžadováno alespoň jedno)
fi_fi: Salasanaa ei ole annettu! (vähintään yksi vaaditaan)
sk_sk: Nebolo zadané žiadne heslo! (potrebné minimálne 1)

# NoReadingPasswordWarning
source: No document password entered! Continue anyway?
cs_cz: Nebylo zadáno heslo pro čtení dokumentu! Pokračovat?
fi_fi: Lukitussalasanaa ei ole annettu! Jatketaanko?
sk_sk: Nebolo zadané heslo pre uzamknutie čitania! Pokračovať?

source: Warning
cs_cz: Upozornění
fi_fi: Varoitus
sk_sk: Upozornenie

# ConfirmReadingPassword
source: Please confirm the document password.
cs_cz: Potvrďte prosím heslo pro čtení dokumentu.
fi_fi: Anna lukitussalasana vahvistukseksi.
sk_sk: Zadajte heslo uzamknutia čítania pre potvrdenie.

# ConfirmReadingPasswordTitle
source: Confirm Document Password
cs_cz: Potvrzení hesla pro čtení
fi_fi: Lukitussalasanan vahvistus
sk_sk: Potvrdenie hesla uzamknutia čítania

# PasswordsMismatch
source: Passwords do not match. Please try again.
cs_cz: Hesla se neshodují. Zkuste to znovu.
fi_fi: Salasanat eivät täsmää. Yritä uudelleen.
sk_sk: Hesla sa nezhodujú. Zopakujte.

# OwnerPasswordSetConfirm
source: An owner password has been set. Please confirm it now.
cs_cz: Heslo vlastníka bylo nastaveno. Potvrďte ho prosím.
fi_fi: Omistajan salasana on asetettu. Vahvista salasana uudelleen.
sk_sk: Heslo vlastníka bolo nastavené. Potvrdťe prosím heslo opät.

# ConfirmOwnerPasswordTitle
source: Confirm Owner Password
cs_cz: Potvrzení hesla vlastníka
fi_fi: Omistajan salasanan vahvistus
sk_sk: Potvrdenie hesla vlastníka

# OwnerPasswordMismatch
source: Owner password does not match. Please try again.
cs_cz: Heslo vlastníka se neshoduje. Zkuste to znovu.
fi_fi: Omistajan salasana ei täsmää. Yritä uudelleen.
sk_sk: Heslo vlastníka nie je rovnaké. Prosím, zopakujte.

# UnknownError
source: An unexpected error occurred while processing the file:
cs_cz: Při zpracování souboru došlo k neočekávané chybě:
fi_fi: Tuntematon virhe tiedoston käsittelyssä:
sk_sk: Neznáma chyba počas spracovania súboru:

# IncorrectPassword
source: Incorrect password. Please try again.
cs_cz: Nesprávné heslo. Zkuste to znovu.
fi_fi: Väärä salasana. Yritä uudelleen.
sk_sk: Nesprávné heslo. Skúste opäť.

# OwnerPasswordRequired
source: This PDF is also protected with an owner password. You need to enter that password.
cs_cz: Tento PDF je chráněn také heslem vlastníka. Musíte zadat toto heslo.
fi_fi: PDF on myös omistajan salasanalla suojattu. Anna salasana.
sk_sk: PDF je chránené aj heslom vlastníka. Potrebné zadať toto heslo.

source: Information
cs_cz: Informace
fi_fi: Tiedote
sk_sk: Informácia

# UnknownErrorShort
source: An unexpected error occurred!
cs_cz: Došlo k neočekávané chybě!
fi_fi: Tuntematon virhe!
sk_sk: Neznáma chyba!

# CannotRunCommand
source: Cannot execute command. Error:
cs_cz: Nelze spustit příkaz. Chyba:
fi_fi: Komentoa ei voida suorittaa. Virhe:
sk_sk: Nie je možné spustiť príkaz. Chyba:

# SettingsTitle
source: Settings
cs_cz: Nastavení
fi_fi: Asetukset
sk_sk: Nastavenia

# Copyright
source: Copyright 2024. Licensed under AGPL.
cs_cz: Copyright 2025. Licencováno pod AGPL.
fi_fi: Tekijänoikeus 2025. Lisensoitu <a href="https://en.wikipedia.org/wiki/GNU_Affero_General_Public_License">AGPL:n</a> mukaan.
sk_sk: Copyright 2024. Licencované podľa AGPL.

# Confirm
source: Save
cs_cz: Uložit
fi_fi: Vahvista
sk_sk: Potvrdiť

source: Cancel
cs_cz: Zrušit
fi_fi: Peruuta
sk_sk: Stornovať

source: After Successful Encryption
cs_cz: Po úspěšném šifrování
fi_fi: Salauksen onnistuttua
sk_sk: Po úspešnom zašifrovaní

# OutputFilePathAdded
source: (Output file path will be added as the last parameter)
cs_cz: (Cesta k výstupnímu souboru bude přidána jako poslední parametr)
fi_fi: (Tulostiedoston polku lisätty viimeisenä parametrina)
sk_sk: (Cesta výstupneho súboru je pridaná ako posledný parameter)

source: Parameters:
cs_cz: Parametry:
fi_fi: Parametrit:
sk_sk: Parametre:

# ParametersPlaceholder
source: (program parameters)
cs_cz: (parametry programu)
fi_fi: (ohjelman parametrit)
sk_sk: (parametre programu)

source: Open output file
cs_cz: Otevřít výstupní soubor
fi_fi: Avaa tulostiedosto
sk_sk: Otvoriť výstupný súbor

# OpenFileInExplorer
source: Show in File Explorer
cs_cz: Zobrazit v Průzkumníku souborů
fi_fi: Avaa tiedosto Tutkassa
sk_sk: Otvoriť súbor v Priekumníkovi

# ClosePDFPass
source: Close PDFPass when done
cs_cz: Zavřít PDFPass po dokončení
fi_fi: Sulje PDFPass
sk_sk: Zatvoriť PDFPass

source: Run program:
cs_cz: Spustit program:
fi_fi: Avaa ohjelma:
sk_sk: Spustiť program:

# ProgramPathPlaceholder
source: (path to program)
cs_cz: (cesta k programu)
fi_fi: (polku ohjelmaan)
sk_sk: (cesta k programu)

source: Encryption Options
cs_cz: Možnosti šifrování
fi_fi: Salausvaihtoehdot
sk_sk: Možnosti šifrovania

source: Set automatically
cs_cz: Nastavit automaticky
fi_fi: Aseta automaattisesti
sk_sk: Nastaviť automaticky

source: Owner password:
cs_cz: Heslo vlastníka:
fi_fi: Omistajan salasana:
sk_sk: Heslo vlastníka:

source: (permanent owner password)
cs_cz: (trvalé heslo vlastníka)
fi_fi: (pysyvä omistajan salasana)
sk_sk: (trvalé heslo vlastníka)

# PermissionsIgnoredWarning
source: Some PDF viewers may ignore these permission settings.
cs_cz: Některé PDF prohlížeče mohou tato oprávnění ignorovat.
fi_fi: Jotkin PDF-katseluohjelmat eivät huomioi näitä oikeuksia.
sk_sk: Tieto oprávnenia niektoré PDF prehliadače ignorujú.

# AllowPrintingLowRes
source: Allow printing (low resolution)
cs_cz: Povolit tisk (nízké rozlišení)
fi_fi: Salli tulostus (matalaresoluutio)
sk_sk: Povoliť tlač (nízke rozlíšenie)

source: Allow page arrangement
cs_cz: Povolit úpravu stránek
fi_fi: Salli sivujen järjestäminen
sk_sk: Povoliť usporiadanie stránok

# AllowAccessTechnologies
source: Allow accessibility technologies
cs_cz: Povolit asistenční technologie
fi_fi: Salli apuvälineet
sk_sk: Povoliť asistenčné technológie

# AllowFillForm
source: Allow form filling
cs_cz: Povolit vyplňování formulářů
fi_fi: Salli lomakkeen täyttö
sk_sk: Povoliť vyplniť formulár

# AllowAddAnnotations
source: Allow adding annotations
cs_cz: Povolit přidávání poznámek
fi_fi: Salli muistiinpanojen lisääminen
sk_sk: Povoliť pridanie anotácií

# AllowDocumentModification
source: Allow document editing
cs_cz: Povolit úpravy dokumentu
fi_fi: Salli dokumentin muokkaus
sk_sk: Povoliť úpravy dokumentu

# AllowContentCopy
source: Allow content copying
cs_cz: Povolit kopírování obsahu
fi_fi: Salli sisällön kopiointi
sk_sk: Povoliť kopírovanie obsahu

source: Permissions for Output File
cs_cz: Oprávnění pro výstupní soubor
fi_fi: Tulostiedoston oikeudet
sk_sk: Oprávnenia pre výstupný súbor

# AllowPrintingHighRes
source: Allow printing (high resolution)
cs_cz: Povolit tisk (vysoké rozlišení)
fi_fi: Salli tulostus (korkea resoluutio)
sk_sk: Povoliť tlač (vysoké rozlíšenie)

source: Encrypt metadata
cs_cz: Šifrovat metadata
fi_fi: Salaa metadata
sk_sk: Zašifrovať metadata

source: Algorithm:
cs_cz: Algoritmus:
fi_fi: Algoritmi:
sk_sk: Algoritmus:

# ConfirmPassword
source: Confirm passwords
cs_cz: Potvrzovat hesla
fi_fi: Vahvista salasana
sk_sk: Potvrdiť heslo

# ExecutableFiles
source: Executable files (*.exe, *.bat, *.com)
cs_cz: Spustitelné soubory (*.exe, *.bat, *.com)
fi_fi: Suoritettavat tiedostot (*.exe, *.bat, *.com)
sk_sk: Spustiteľné súbory (*.exe, *.bat, *.com)

# SupportDeveloper
source: Support the developer with a small donation! 💳
cs_cz: Podpořte vývojáře malým příspěvkem! 💳
fi_fi: Voit tukea kehittäjää pienellä summalla! 💳
sk_sk: Autora môžete dobrovoľne podporiť malou sumou! 💳

# AES256Recommended
source: AES-256 (Adobe Reader 8+) [recommended]
cs_cz: AES-256 (Adobe Reader 8+) [doporučeno]
fi_fi: AES-256 (Adobe Reader 8+) [suositellaan]
sk_sk: AES-256 (Adobe Reader 8+) [odporúčané]

# RunFileNotExists
source: The program file to run does not exist.
cs_cz: Soubor programu ke spuštění neexistuje.
fi_fi: Käynnistettävä tiedosto ei ole olemassa.
sk_sk: Súbor pre spustenie neexistuje.

# LanguageTitle
source: Jazyk / Language / Jazyk
fi_fi: Jazyk / Language / Kieli

# LanguageChangeRestartRequired
source: The language change will fully apply after restarting the application.
cs_cz: Změna jazyka se plně projeví po restartu aplikace.
fi_fi: Kielen vaihto tulee voimaan sovelluksen käynnistyksen jälkeen.
sk_sk: Zmena jazyka sa plne prejaví po reštarte aplikácie.

source: Set Owner Password
cs_cz: Nastavit heslo vlastníka
fi_fi: Aseta omistajan salasana
sk_sk: Nastaviť heslo vlastníka

# EnterOwnerPasswordPrompt
source: Enter the owner password.\r\n(Owner password restricts modifications to the PDF)\r\n\r\nPress \"Cancel\" to REMOVE the owner password
cs_cz: Zadejte heslo vlastníka.\r\n(Heslo vlastníka omezuje úpravy PDF)\r\n\r\nStiskněte \"Zrušit\" pro ODSTRANĚNÍ hesla vlastníka
fi_fi: Anna omistajan salasana. (Omistajan salasana rajoittaa PDF:n sisällön muokkausta) Paina "Peruuta" jos haluat PERUAA omistajan salasanan
sk_sk: Zadajte heslo vlastníka.\r\n(Heslo vlastníka obmedzí manipuláciu s obsahom PDF)\r\n\r\nStlačte \"Stornovať\", ak chcete ZRUŠIŤ heslo vlastníka

# FillWithDefaultPassword
source: Use default password from Settings
cs_cz: Použít výchozí heslo z nastavení
fi_fi: Täytä oletussalasanalla Asetuksista
sk_sk: Vyplniť predvoleným heslom z Nastavení

# OwnerPassOption
source: Specify the owner password
cs_cz: Zadejte heslo vlastníka
fi_fi: Anna omistajan salasana
sk_sk: Zadajte heslo vlastníka

# UserPassOption
source: Specify the user password
cs_cz: Zadejte uživatelské heslo
fi_fi: Anna käyttäjän salasana
sk_sk: Zadajte heslo používateľa

# InputFileOption
source: Specify the PDF file to encrypt
cs_cz: Zadejte PDF soubor k zašifrování
fi_fi: Anna salattavaksi PDF-tiedosto
sk_sk: Uveďte vstupný PDF súbor k zašifrovaniu

# OutputFileOption
source: Specify the encrypted output file
cs_cz: Zadejte výstupní zašifrovaný soubor
fi_fi: Anna salattu tulostiedosto
sk_sk: Uveďte výstupný zašifrovaný súbor

# RunImmediatelyOption
source: Start encryption immediately (without clicking the Add Password button)
cs_cz: Spustit šifrování okamžitě (bez kliknutí na tlačítko Zabezpečit heslem)
fi_fi: Aloita salaus heti käynnistyksen jälkeen (ei vaadi "Salaa"-painiketta)
sk_sk: Spustiť šifrovanie okamžite po štarte (nevyžaduje stlačenie tlačidla Zahesluj)

# CommandLineError
source: Command line parameter error:
cs_cz: Chyba parametrů příkazového řádku:
fi_fi: Virheelliset komentoriviparametrit:
sk_sk: Chybné parametre príkazového riadku:

source: encrypted
cs_cz: zašifrovaný
fi_fi: salattu
sk_sk: zašifrovaný

source: decrypted
cs_cz: dešifrovaný
fi_fi: purkattu
sk_sk: dešifrovaný
